app/Controllers/Articles.php

    public function index()
    {
        $model = model('App\Models\ArticleModel');

        $search = $this->request->getGet('search');
        $order = $this->request->getGet('order');
        $dir = $this->request->getGet('dir');
        $limit = $this->request->getGet('limit') ?? 9;

        $model = $model
            ->select('articles.id, articles.title, users.name as author, categories.name as category, articles.created_at')
            ->join('users', 'users.id = articles.author')
            ->join('categories', 'categories.id = articles.category');
        if (!empty($search)) {
            $model = $model->like('title', $search);
        }

        if (!empty($order) && !empty($dir)) {
            $model = $model->orderBy($order, $dir);
        }

        $data = [
            'section' => 'articles',
            'target' => 'list',
            'articles' => $model->paginate($limit),
---
SELECT COUNT(*) AS `numrows`
FROM `articles`
JOIN `users` ON `users`.`id` = `articles`.`author`
JOIN `categories` ON `categories`.`id` = `articles`.`category`
SELECT `articles`.`id`, `articles`.`title`, `users`.`name` as `author`, `categories`.`name` as `category`, `articles`.`created_at`
FROM `articles`
JOIN `users` ON `users`.`id` = `articles`.`author`
JOIN `categories` ON `categories`.`id` = `articles`.`category`
 LIMIT 9