app/Controllers/Categories.php

SELECT *
FROM `categories`
 LIMIT 9
SELECT COUNT(*) AS `numrows`
FROM `categories`
---
    public function index()
    {
        $model = model('App\Models\CategoryModel');

        $search = $this->request->getGet('search');
        $order = $this->request->getGet('order');
        $dir = $this->request->getGet('dir');
        $limit = $this->request->getGet('limit') ?? 9;

        if (!empty($search)) {
            $model = $model
                ->like('name', $search)
                ->orLike('note', $search);
        }

        if (!empty($order) && !empty($dir)) {
            $model = $model->orderBy($order, $dir);
        }

        $data = [
            'section' => 'categories',
            'target' => 'list',
            'categories' => $model->paginate($limit),