app/Controllers/Users.php

SELECT *
FROM `users`
 LIMIT 9
SELECT COUNT(*) AS `numrows`
FROM `users`
---
    public function index()
    {
        $model = model('App\Models\UserModel');
        $search = $this->request->getGet('search');
        $order = $this->request->getGet('order');
        $dir = $this->request->getGet('dir');
        $limit = $this->request->getGet('limit') ?? 9;

        if (!empty($search)) {
            $model = $model
                ->like('name', $search)
                ->orLike('email', $search)
                ->orLike('username', $search);
        }

        if (!empty($order) && !empty($dir)) {
            $model = $model
                ->orderBy($order, $dir);
        }

        $data = [
            'section' => 'users',
            'users' => $model->paginate($limit),